//Задача МАР

/*
Зберегти розклад занять, використовуючи дні тижня, як ключі
а значеннями будуть списки занять, які відбуваються у відповідний день
*/
const schedule = new Map();

//Додавання занять до розкладу
schedule.set('Понеділок',['Математика','Фізика']);
schedule.set('Вівторок',['Англійська мова','Всесвітня історія']);
schedule.set('Середа',['Хімія', 'Географія']);
schedule.set('Четвер', ['Зарубжна література', 'Біологія']);
schedule.set('П\`ятниця',['Інформатика','Фізкультура']);

//Отримання розкладу занять для певного дня
console.log(schedule.get('Понеділок'))
console.log(schedule);

//Перевірка, чи є розклад для певного дня
console.log(schedule.has('Середа'));
console.log(schedule.has('Субота'));

//Отримати кількість днів занять в розкладі
console.log(schedule.size);

