//Задача
/*
Ми маємо зміну, яка вказує на кількість хвилин в годині
Визнате, в якій чверті години знаходиться ця кількість хвилин

Якщо кількість хвилин попадає в першу чверть години - вивести на консоль перша чверть години
Якщо кількість хвилин попадає в другу чверть години - вивести на консоль друга чверть години
Якщо кількість хвилин попадає в третю чверть години - вивести на консоль третя чверть години
Якщо кількість хвилин попадає в четверту чверть години - вивести на консоль четверта чверть години

 */
let min = 45;

if (min>=0 && min<=15){
   console.log('Перша чверть');
} else if (min>=16 && min<=30){
   console.log('Друга чверть');
} else if (min>=31 && min<=45){
   console.log('Третя чверть');
} else if (min>=46 && min<=59){
   console.log('Четверта чверть');
} else {
   console.log('Виникла помилка');
}


//Задача 2
/*
Визберігаєте у змінній рік
потрібно визначити чи є цей рік високосним
Рік є високосний, якщо його номер є кратний 4, фле не кратний 100, 
також якщо він кратний 400
 */

const year = 1948;
if (year % 4 === 0 && year % 100 !== 0 || year % 400 === 0){
   console.log(year +' є висоокосним');
} else{
   console.log(year +' не є високосним');
}


//Задача 3
/*
У вас є задане початкове і кінцеве число діапазону, і також певне число
Вам потрібно визначити, чи входить це число в заданий діапозон, чині
 */

const left = 10; // початкове значення діапазону
const right = 20; // кінцеве значення діапазону
const number = 17;

if(number >= 10 && number <= 20) {
   console.log(number + ' є ' + '[' + left + ';' + right + '];');
} else {
   console.log('Поза діапазоном');
}

//Задача 4
/*
У нас є Козак Вус, який проводить змагання з програиування, в якому беруть участь n- людей
Козак вирішив нагородити їх усіх ручками та блокнотами
Відомо, що Вус має рівно m - ручок і а - блокнотів
Визначити, чи може козак Вус нагородити всіх учасників,
даючи кожному з них як мінімум по одній ручці і як мінімум по одному блоконоту
 */

const n = 20; // кількість учасників
const m = 50; // кількість ручок
const k = 50; // кількість блокнотів

if (m >= n && k >= n){
   console.log('Так, зможе нагородити');
} else {
   console.log('Він не зможе нагородити');
}

/*
5. Ви є організатором розважальної програми
 і вам потрібно розподілити вхідні квитки на осонві віку відвідувачів.
 Вхідні квитки мають різін ціни в залежності від віку відвідувачів.
 Вам потрібно реалізувати таку логіку, яка в залежності від віку
 відвідувача повертає вартість його квитка згідно наступних умов.

 - Діти до 6 років: безкоштовний вхід.
 - Діти від 6 до 12 років (включно): квиток коштує $10.
 - Дорослі від 12 років і старше: квиток коштує $20.

 Ящо дорослий надає документ, що підтверджує його право на пільги, 
 то такому дорослому надається знижка 50%  
*/

const age = 18; // Вік відвідувача
const hasDiscount = true; // Наявність знижки у дорослого

let ticketPrice; //зараз тут undefined. бо ми не позначили змінну

if(age < 0 || typeof age !== 'number') // якщо вік менше нуля або вік не є числом
{
   console.log('Ви вели некоректний вік відвідувача. Спробуйте ще.');
} else if (age <= 6){
   ticketPrice = 0;
} else if(age <= 12){
   ticketPrice = 10;
} else if(hasDiscount === false){
   ticketPrice = 20;
}else {// відвідувач має знижку 50%
   ticketPrice = 10; // 20 % 2 
}

if(ticketPrice !== undefined){
   console.log('Вартість квитка складає ' +  ticketPrice + '$');
}
