/*
Знайди Середнє
Знайти середнє (середнє) списку чисел у масиві.

Інформація
Щоб знайти середнє (середнє) набору чисел, додайте всі числа разом і поділіть на кількість значень у списку.

Для прикладу список 1, 3, 5, 7

1. Складіть усі числа

1+3+5+7 = 16
2. Розділіть на кількість значень у списку. У цьому прикладі в списку є 4 номери.

16/4 = 4
3. Середнє (або середнє) цього списку дорівнює 4

 */

const numbers = [1,3,5,7]
//1.
let summa = 0;
for(let i = 0;i < numbers.length;i++){
    summa +=numbers[i];
}
console.log(summa); //16

//2.
let average = summa / 4;
console.log(average) //4
