// ПРАКТИКА МЕТОДИ МАСИВУ
/*Задача1.
Дано два масиви [1,2,3] і [4,5,6]
Потрібно об'єднати в один масив щоб вийшло [1,2,3,4,5,6]
 */
const array1 = [1,2,3];
const array2 = [4,5,6];
const array3 = array1.concat(array2);
console.log(array3);

// коли масивів більше одного
const array01 = [1,2,3];
const array02 = [4,5,6];
const array03 = [1,2,3];
const array04 = [4,5,6];
const array05 = array01.concat(array02,array03,array04);
console.log(array05)

//-------------------------------------------------------------------------------
/*Задача2.
Дано масив [1,2,3] 
Потрібно з нього зробити масив [3,2,1] 
 */
const array4 = [1,2,3];
console.log(array4.reverse()); 
//-------------------------------------------------------------------------------
/*Задача3.
Дано масив [3,4,5] 
Додайте йому в кінець елементи 4,8,10
 */
const array5 = [3,4,5];
console.log(array5.push(4,8,10));
console.log(array5);
//-------------------------------------------------------------------------------
/*Задача4.
Дано масив ['aaa','bbb','ccc'] 
Виведіть у консоль останній елемент та видаліть його з масиву
 */
const array6 = ['aaa','bbb','ccc'];
console.log(array6.pop());
console.log(array6);
//------------------------------------------------------------------------------- 
/*Задача5.
Дано масив ['3',7,10] 
Додайте йому на початок елементи 2,8
 */
const array7 = ['3',7,10];
console.log(array7.unshift(2,8));
console.log(array7);
//-------------------------------------------------------------------------------  
/*Задача6.
Дано масив ['3',7,10] 
Отримайте з цього масиву рядок
 */
const array8 = ['3',7,10];
console.log(array8.join(','))
