// МАСИВ (Array) Практика
/*Задача2
Дано масив чисел [3,6,8,2,3,5,1]
Написати функцію яка знаходить найбільше значення серед елементів масива
1. десь поинні запам'ятати найбільше число де ми зустріли
2. порівняти це число з наступним елементом масиву
3. якщо елемент масиву опинеться більшим ніж число, яке ми запам'ятали
то саме цей елемент масиву стає найбільшим запам'ятованим
 */
let array = [3, 6, 8, 2, 3, 5, 1];

function lookForMaxNumber(array) {
  let maxNamber = array[0]; // якоби максимальне число є перший елемент масива перше 0

for(let i = 0; i < array.length; i++)  {
    // починаємо перебирати масив від пнршого елементу до останього
    if (array[i] > maxNamber) {
      //якщо поточний переглядаємий клкмент масиву більше ніж максимальне число, яке ми запам'ятали
      maxNamber = array[i]; // максимальне число дорівнює поточному переглядаємому елементу масива
    }
  }
  return maxNamber;
}
console.log(lookForMaxNumber(array))