//Задача 3
/*Написати функцію, яка знаходить середнє арифметичне всіх елементів масиву
Середнє арифметичне = сума всіх елементів масиву / на всю кількість елементів масиву
*/
const sum =[3,6,8,2,3,5,1]

function summaAllElementsArray(array){
  let result = 0;// створення змінної, де ми накопичуємо суму

  for(let i = 0; i < sum.length; i++){//цеклічне накопичення суми
   result+=sum[i];//повернення результату після проходження всього циклу
  }
  return result / sum.length; //результат поділений на максимальну кількість елементів
}
console.log(summaAllElementsArray(sum))


